In [3]:
pwd

'C:\\Users\\USER\\Desktop\\PRACTICE_WORLQUANT_\\Pandas-Data-Exploration'

In [2]:
#importing the libraries and modules
import pandas as pd
import numpy as np

In [4]:
#importing the dataset in csv format
df1 = pd.read_csv ("Housing-in-Mexico.csv")
df2 = pd.read_csv ("Housing-in-Mexico - 2.csv")
df3 = pd.read_csv ("Housing-in-Mexico - 3.csv")

## Data Cleaning

In [5]:
#Checking for the shape of the dataset i.e the number of observations and features
df1.shape
df2.shape
df3.shape

(1000, 6)

In [10]:
#Checking for the datatypes of the dataset
df1.info()
df2.info()
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          133 non-null    object
 2   latitude       1000 non-null   float64
 3   longitude      1000 non-null   float64
 4   area           1000 non-null   float64
 5   price          1000 non-null   object
dtypes: float64(3), object(3)
memory usage: 47.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          133 non-null    object
 2   latitude       1000 non-null   float64
 3   longitude      1000 non-null   float64
 4   area           1000 non-null   float64
 5   price          1000 non-null   object
dtypes: float64(3), object(3)
memory usage: 47.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          133 non-null    object
 2   latitude       1000 non-null   float64
 3   longitude      1000 non-null   float64
 4   area           1000 non-null   float64
 5   price          1000 non-null   object
dtypes: float64(3), object(3)
memory usage: 47.0+ KB

In [11]:
#Checking for the first 5 rows
df1.head()
df2.head()
df3.head()

  property_type state   latitude   longitude    area     price
0     townhouse   NaN  43.258740   17.888008  434.97  $541,885
1         house   NaN  34.620202  112.453926  348.25  $601,831
2         condo   NaN  -4.163679   18.807620  729.05  $153,200
3     townhouse   NaN  22.826877  107.840624  431.57  $646,160
4         villa   NaN  27.483293  120.562211  135.08  $885,209

In [6]:
#Checking for the values in a particular column-shows frist and last 5
df1['price']

0      $541,885
1      $601,831
2      $153,200
3      $646,160
4      $885,209
         ...
995    $432,552
996    $302,069
997    $568,993
998    $988,252
999    $135,854
Name: price, Length: 1000, dtype: object

In [13]:
#Checking for the values between observations (50-60) in price.
df2.price[50:61]

50    $346,695
51    $538,717
52     $65,042
53    $757,693
54    $111,287
55    $527,265
56    $721,955
57    $251,340
58    $929,803
59    $889,551
60    $610,061
Name: price, dtype: object

In [7]:
# Ensure 'price' column is of string data type
df1['price'] = df1['price'].astype(str)

"""To drop a column that is not needed or in use then use the method
df.drop(columns=["price"] inplace=True)"""

#To remove '$' and ',' from the price column and change the datatype to floating-point(float) for manipulation of data with pandas.
df1["price"]= (
    df1["price"]
    .str.replace("$" , "", regex=False)
    .str.replace("," , "")
    .astype(float)
)
df1.info()
df1.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          133 non-null    object
 2   latitude       1000 non-null   float64
 3   longitude      1000 non-null   float64
 4   area           1000 non-null   float64
 5   price          1000 non-null   float64
dtypes: float64(4), object(2)
memory usage: 47.0+ KB

  property_type state   latitude   longitude    area     price
0     townhouse   NaN  43.258740   17.888008  434.97  541885.0
1         house   NaN  34.620202  112.453926  348.25  601831.0
2         condo   NaN  -4.163679   18.807620  729.05  153200.0
3     townhouse   NaN  22.826877  107.840624  431.57  646160.0
4         villa   NaN  27.483293  120.562211  135.08  885209.0

In [15]:
# Ensure 'price' column is of string data type
df2['price'] = df2['price'].astype(str)

"""To drop a column that is not needed or in use then use the method
df.drop(columns=["price"] inplace=True)"""

#To remove '$' and ',' from the price column and change the datatype to floating-point(float) for manipulation of data with pandas.
df2["price"]= (
    df2["price"]
    .str.replace("$" , "", regex=False)
    .str.replace("," , "")
    .astype(float)
)
df2.info()
df2.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          133 non-null    object
 2   latitude       1000 non-null   float64
 3   longitude      1000 non-null   float64
 4   area           1000 non-null   float64
 5   price          1000 non-null   float64
dtypes: float64(4), object(2)
memory usage: 47.0+ KB

  property_type state   latitude   longitude    area     price
0     townhouse   NaN  43.258740   17.888008  434.97  541885.0
1         house   NaN  34.620202  112.453926  348.25  601831.0
2         condo   NaN  -4.163679   18.807620  729.05  153200.0
3     townhouse   NaN  22.826877  107.840624  431.57  646160.0
4         villa   NaN  27.483293  120.562211  135.08  885209.0

In [8]:
# Ensure 'price' column is of string data type
df3['price'] = df3['price'].astype(str)

"""To drop a column that is not needed or in use then use the method
df.drop(columns=["price"] inplace=True)"""

#To remove '$' and ',' from the price column and change the datatype to floating-point(float) for manipulation of data with pandas.
df3["price"]= (
    df3["price"]
    .str.replace("$" , "", regex=False)
    .str.replace("," , "")
    .astype(float)
)
df3.info()
df3.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          133 non-null    object
 2   latitude       1000 non-null   float64
 3   longitude      1000 non-null   float64
 4   area           1000 non-null   float64
 5   price          1000 non-null   float64
dtypes: float64(4), object(2)
memory usage: 47.0+ KB

  property_type state   latitude   longitude    area     price
0     townhouse   NaN  43.258740   17.888008  434.97  541885.0
1         house   NaN  34.620202  112.453926  348.25  601831.0
2         condo   NaN  -4.163679   18.807620  729.05  153200.0
3     townhouse   NaN  22.826877  107.840624  431.57  646160.0
4         villa   NaN  27.483293  120.562211  135.08  885209.0

In [9]:
#Checking for the shape of the dataset i.e the number of observations and features
df1.shape
df2.shape
df3.shape

(1000, 6)

In [10]:
#Concatenation of the 3 cleaned datasets
final_df = pd.concat([df1, df2, df3])
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  3000 non-null   object
 1   state          399 non-null    object
 2   latitude       3000 non-null   float64
 3   longitude      3000 non-null   float64
 4   area           3000 non-null   float64
 5   price          3000 non-null   object
dtypes: float64(3), object(3)
memory usage: 164.1+ KB

In [12]:
#Saving the final dataframe to a CSV file
final_df.to_csv("C:\\Users\\USER\\Desktop\\PRACTICE_WORLQUANT_\\Pandas-Data-Exploration\\Proj1-Housing.csv", index=False)